print('Задача 2. Функция максимума')

# Юра пишет различные полезные функции для Python, чтобы остальным программистам стало проще работать. Он захотел написать функцию, которая будет находить максимум из перечисленных чисел. Функция для нахождения максимума из двух чисел у него уже есть. Юра задумался: может быть, её можно как-то использовать для нахождения максимума уже от трёх чисел?

# Помогите Юре написать программу, которая находит максимум из трёх чисел. Для этого используйте только функцию нахождения максимума из двух чисел.

# По итогу в программе должны быть реализованы две функции:
# 1) maximum_of_two — функция принимает два числа и возвращает одно (наибольшее из двух);
# 2) maximum_of_three — функция принимает три числа и возвращает одно (наибольшее из трёх); при этом она должна использовать для сравнений первую функцию maximum_of_two.

def maximum_of_two(num_1, num_2):
  maxNum = num_1
  if num_2 - num_1 > 1e-16:
    maxNum = num_2
  return maxNum
    

def maximum_of_three(num_1, num_2, num_3):
  maxNum = maximum_of_two(num_1, num_2)
  if num_3 - maxNum > 1e-16:
    maxNum = num_3
  return maxNum

num_1 = float(input('Введите 1-e число: '))
num_2 = float(input('Введите 2-e число: '))
num_3 = float(input('Введите 3-e число: '))
print('Наибольшее из 3-х введенных чисел:', maximum_of_three(num_1, num_2, num_3))

print('\n--------\n')