print('Задача 5. Великий и могучий')

# Паоло изучает русский язык: занимается по учебникам, читает книги, слушает музыку. Ему особенно понравилась книга «Преступление и наказание». Паоло решил найти самое длинное слово в этой книге, чтобы сравнить его с аналогом на своём языке.

# Что нужно сделать

# Напишите программу, которая получает на вход текст и находит длину самого длинного слова в нём. Слова в тексте разделяются одним пробелом.

# Пример:

# Введите текст: Меня зовут Пётр.
# Самое длинное слово, букв: 5.

# Введите текст: Меня зовут Василий
# Самое длинное слово, 7 букв

text = input('Введите текст: ') + ' '
length, maxLength = 0, 0

for symbol in text:
  if symbol != ' ':
    length += 1
  else: 
    if length > maxLength:
      maxLength = length
    length = 0
print('\nСамое длинное слово -', maxLength, 'букв')
    
  




print('\n--------\n')